#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.aws_s3_bucket_object.frontend["package.json"]: Refreshing state... [id=package.json]
module.frontend.aws_s3_bucket_object.frontend[".gitignore"]: Refreshing state... [id=.gitignore]
module.frontend.aws_s3_bucket_object.frontend[".browserslistrc"]: Refreshing state... [id=.browserslistrc]
module.frontend.aws_s3_bucket_object.frontend["babel.config.js"]: Refreshing state... [id=babel.config.js]
module.frontend.aws_s3_bucket_object.frontend["README.md"]: Refreshing state... [id=README.md]
module.frontend.aws_s3_bucket_object.frontend["cypress.json"]: Refreshing state... [id=cypress.json]
module.frontend.aws_s3_object.frontend["node_modules/es-abstract/2018/DefinePropertyOrThrow.js"]: Refreshing state... [id=node_modules/es-abstract/2018/DefinePropertyOrThrow.js]
module.frontend.aws_s3_bucket_object.frontend["package-lock.json"]: Refreshing state... [id=package-lock.json]
module.frontend.aws_s3_bucket_object.frontend[".eslintrc.js"]: Refreshing state... [id=.eslintrc.js]
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E2KG39NGUA7DI2]
module.frontend.aws_route53_record.example["video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.aws_route53_record.example["www.video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.frontend.aws_s3_bucket_public_access_block.bucket_pab: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.frontend.aws_route53_record.subdomain_www[0]: Refreshing state... [id=Z1M325FGK1MICN_www.video_A]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z1M325FGK1MICN_video_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.frontend.aws_cloudfront_origin_access_identity.oai has changed
  ~ resource "aws_cloudfront_origin_access_identity" "oai" {
      ~ etag                            = "ECHIPB9EHXRKG" -> "E3VJ5SQRCP83W3"
        id                              = "E2KG39NGUA7DI2"
        # (5 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend[".browserslistrc"] has changed
  ~ resource "aws_s3_bucket_object" "frontend" {
        id                 = ".browserslistrc"
      + metadata           = {}
      + tags               = {}
        # (11 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend[".eslintrc.js"] has changed
  ~ resource "aws_s3_bucket_object" "frontend" {
        id                 = ".eslintrc.js"
      + metadata           = {}
      + tags               = {}
        # (11 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend[".gitignore"] has changed
  ~ resource "aws_s3_bucket_object" "frontend" {
        id                 = ".gitignore"
      + metadata           = {}
      + tags               = {}
        # (11 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["README.md"] has changed
  ~ resource "aws_s3_bucket_object" "frontend" {
        id                 = "README.md"
      + metadata           = {}
      + tags               = {}
        # (11 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["babel.config.js"] has changed
  ~ resource "aws_s3_bucket_object" "frontend" {
        id                 = "babel.config.js"
      + metadata           = {}
      + tags               = {}
        # (11 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["cypress.json"] has changed
  ~ resource "aws_s3_bucket_object" "frontend" {
        id                 = "cypress.json"
      + metadata           = {}
      + tags               = {}
        # (11 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["package-lock.json"] has changed
  ~ resource "aws_s3_bucket_object" "frontend" {
        id                 = "package-lock.json"
      + metadata           = {}
      + tags               = {}
        # (11 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["package.json"] has changed
  ~ resource "aws_s3_bucket_object" "frontend" {
        id                 = "package.json"
      + metadata           = {}
      + tags               = {}
        # (11 unchanged attributes hidden)
    }

  # module.frontend.aws_s3_object.frontend["node_modules/es-abstract/2018/DefinePropertyOrThrow.js"] has changed
  ~ resource "aws_s3_object" "frontend" {
        id                 = "node_modules/es-abstract/2018/DefinePropertyOrThrow.js"
      + metadata           = {}
      + tags               = {}
        # (11 unchanged attributes hidden)
    }

  # module.frontend.aws_wafv2_web_acl.waf_acl has changed
  ~ resource "aws_wafv2_web_acl" "waf_acl" {
        id         = "4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c"
        name       = "video_waf"
        tags       = {}
        # (5 unchanged attributes hidden)


      + rule {
          + name     = "AWS-AWSManagedRulesAdminProtectionRuleSet"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAdminProtectionRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWS-AWSManagedRulesAdminProtectionRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWS-AWSManagedRulesAdminProtectionRuleSet" -> null
          - priority = 1 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAdminProtectionRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWS-AWSManagedRulesAdminProtectionRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWS-AWSManagedRulesCommonRuleSet"
          + priority = 0

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWS-AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWS-AWSManagedRulesCommonRuleSet" -> null
          - priority = 0 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWS-AWSManagedRulesCommonRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWS-AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 4

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWS-AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWS-AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 4 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWS-AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWS-AWSManagedRulesSQLiRuleSet"
          + priority = 7

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesSQLiRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWS-AWSManagedRulesSQLiRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWS-AWSManagedRulesSQLiRuleSet" -> null
          - priority = 7 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesSQLiRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWS-AWSManagedRulesSQLiRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.backend_dev.aws_cognito_user_pool.user_pool will be created
  + resource "aws_cognito_user_pool" "user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "videoStreamer-dev"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + password_policy {
          + minimum_length                   = (known after apply)
          + require_lowercase                = (known after apply)
          + require_numbers                  = (known after apply)
          + require_symbols                  = (known after apply)
          + require_uppercase                = (known after apply)
          + temporary_password_validity_days = (known after apply)
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.frontend.aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E2QZVOHCSCH69J"
        tags                           = {
            "Environment" = "video.rayprogramming.com"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl              = 0 -> 3600
          ~ max_ttl                  = 0 -> 86400
            # (11 unchanged attributes hidden)
        }




        # (4 unchanged blocks hidden)
    }

  # module.frontend.aws_s3_bucket_acl.bucket_acl will be created
  + resource "aws_s3_bucket_acl" "bucket_acl" {
      + acl    = "private"
      + bucket = "video.rayprogramming.com"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.frontend.aws_s3_bucket_object.frontend[".browserslistrc"] will be destroyed
  # (because aws_s3_bucket_object.frontend is not in configuration)
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "cdab46f87a895f73583e23c71abfd739" -> null
      - force_destroy      = false -> null
      - id                 = ".browserslistrc" -> null
      - key                = ".browserslistrc" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/.browserslistrc" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = "m1_cfHOdtPltNiuRecD7YuplOzo6eWGb" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend[".eslintrc.js"] will be destroyed
  # (because aws_s3_bucket_object.frontend is not in configuration)
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/javascript" -> null
      - etag               = "e3b0b17193d2216f2006bc97f96cf70e" -> null
      - force_destroy      = false -> null
      - id                 = ".eslintrc.js" -> null
      - key                = ".eslintrc.js" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/.eslintrc.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = "_446RMVMdTcsVclJbd_y6y4m8P6sTf1d" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend[".gitignore"] will be destroyed
  # (because aws_s3_bucket_object.frontend is not in configuration)
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "1be540e65b34eb71fd7ae867d34e8ee0" -> null
      - force_destroy      = false -> null
      - id                 = ".gitignore" -> null
      - key                = ".gitignore" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/.gitignore" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = "6QOm5n2rqAWVSzsJ9oYgXWBNTyu21AMY" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend["README.md"] will be destroyed
  # (because aws_s3_bucket_object.frontend is not in configuration)
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "4f860a661738739d7c10ef8eb36034f9" -> null
      - force_destroy      = false -> null
      - id                 = "README.md" -> null
      - key                = "README.md" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/README.md" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = "i8wlK8pFlRom3mM3rgCQNnZd02yJoum8" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend["babel.config.js"] will be destroyed
  # (because aws_s3_bucket_object.frontend is not in configuration)
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/javascript" -> null
      - etag               = "790cba154004ce8192930464c0da5d07" -> null
      - force_destroy      = false -> null
      - id                 = "babel.config.js" -> null
      - key                = "babel.config.js" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/babel.config.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = "_oHVEKgn99zo4vqzudI4CsfAlzG0clS_" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend["cypress.json"] will be destroyed
  # (because aws_s3_bucket_object.frontend is not in configuration)
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/json" -> null
      - etag               = "c6178d0870294d9085116ffc72dae005" -> null
      - force_destroy      = false -> null
      - id                 = "cypress.json" -> null
      - key                = "cypress.json" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/cypress.json" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = "iBFWq.yrOJxWVT_PLwc8KlesESM96NFv" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend["package-lock.json"] will be destroyed
  # (because aws_s3_bucket_object.frontend is not in configuration)
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/json" -> null
      - etag               = "b2c653fe22ee5657b8f04ce7208b1485" -> null
      - force_destroy      = false -> null
      - id                 = "package-lock.json" -> null
      - key                = "package-lock.json" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/package-lock.json" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = "ATkJNjRp_VL7sg60DtW3xSPldz6.xGrb" -> null
    }

  # module.frontend.aws_s3_bucket_object.frontend["package.json"] will be destroyed
  # (because aws_s3_bucket_object.frontend is not in configuration)
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/json" -> null
      - etag               = "579b27f48ea9907382f35e3c2099a148" -> null
      - force_destroy      = false -> null
      - id                 = "package.json" -> null
      - key                = "package.json" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/package.json" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = "r1DVRNBsSzj.liwMDH5Po54da12AhtgU" -> null
    }

  # module.frontend.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = "video.rayprogramming.com"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "PolicyForCloudFrontPrivateContent"
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2KG39NGUA7DI2"
                        }
                      + Resource  = "arn:aws:s3:::video.rayprogramming.com/*"
                      + Sid       = "1"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

  # module.frontend.aws_s3_bucket_versioning.bucket_version will be created
  + resource "aws_s3_bucket_versioning" "bucket_version" {
      + bucket = "video.rayprogramming.com"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.frontend.aws_s3_object.frontend["node_modules/es-abstract/2018/DefinePropertyOrThrow.js"] will be destroyed
  # (because aws_s3_object.frontend is not in configuration)
  - resource "aws_s3_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/javascript" -> null
      - etag               = "d263b7e80a858811ef41bd5f70730227" -> null
      - force_destroy      = false -> null
      - id                 = "node_modules/es-abstract/2018/DefinePropertyOrThrow.js" -> null
      - key                = "node_modules/es-abstract/2018/DefinePropertyOrThrow.js" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/node_modules/es-abstract/2018/DefinePropertyOrThrow.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = "VuwjTpoPpMmN8b.UCVuZYBav3MdPbQuo" -> null
    }

Plan: 4 to add, 1 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*